# Исследоание базы данных книг

Исследована база данных сервиса для чтения книг по подписке.
Целью исследования является сбор данных для формирования ценностного предложения для нового продукта.

## Подключаемся

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
 db_config['pwd'],
 db_config['host'],
 db_config['port'],
 db_config['db'])
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Обзор

### Таблица **books**

In [2]:
query = '''SELECT * FROM books LIMIT 1'''

In [3]:
pd.io.sql.read_sql(query, con = engine)

   book_id  author_id         title  num_pages publication_date  publisher_id
0        1        546  'Salem's Lot        594       2005-11-01            93

### Таблица authors

In [4]:
query = '''SELECT * FROM authors LIMIT 1'''

In [5]:
pd.io.sql.read_sql(query, con = engine)

   author_id      author
0          1  A.S. Byatt

### Таблица ratings

In [6]:
query = '''SELECT * FROM ratings LIMIT 1'''

In [7]:
pd.io.sql.read_sql(query, con = engine)

   rating_id  book_id    username  rating
0          1        1  ryanfranco       4

### Таблица reviews

In [8]:
query = '''SELECT * FROM reviews LIMIT 1'''

In [9]:
pd.io.sql.read_sql(query, con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...

### Таблица publishers

In [10]:
query = '''SELECT * FROM publishers LIMIT 1'''

In [11]:
pd.io.sql.read_sql(query, con = engine)

   publisher_id publisher
0             1       Ace

## Количество книг, вышедших после 1 января 2000 года

In [12]:
query = '''SELECT COUNT(publication_date) 
           FROM books 
           WHERE publication_date::DATE > '2000-01-01'
        '''

In [13]:
pd.io.sql.read_sql(query, con = engine)

   count
0    819

819 книг вышло после 1 января 2000 года

## Количество обзоров и средняя оценка для каждой книги

In [14]:
query = '''SELECT b.title, COUNT(re.review_id),AVG(ra.rating)       
           FROM reviews AS re
           JOIN ratings AS ra ON re.book_id = ra.book_id
           JOIN books AS b ON re.book_id = b.book_id
           GROUP BY b.title
           ORDER BY COUNT(re.review_id)
        '''

In [15]:
pd.io.sql.read_sql(query, con = engine)

                                                 title  count       avg
0                                            Creepshow      2  4.500000
1                    Winter Prey (Lucas Davenport  #5)      2  4.500000
2                    Naked Empire (Sword of Truth  #8)      2  3.500000
3                                            Babyville      2  3.500000
4                                Ten Apples Up On Top!      2  4.000000
..                                                 ...    ...       ...
988  Harry Potter and the Chamber of Secrets (Harry...    480  4.287500
989  Harry Potter and the Prisoner of Azkaban (Harr...    492  4.414634
990                             The Catcher in the Rye    516  3.825581
991                The Hobbit  or There and Back Again    528  4.125000
992                            Twilight (Twilight  #1)   1120  3.662500

[993 rows x 3 columns]

Больше всего обзоров у **Twilight**

## Издательство с наибольшим числом книг

In [16]:
query = '''WITH list AS
           (
           SELECT  publisher_id, COUNT(book_id) as count
           FROM books
           WHERE num_pages > 50
           GROUP BY publisher_id
           ORDER BY COUNT(book_id) DESC
           LIMIT 1
           )
           SELECT p.publisher, l.count
           FROM list as l
           JOIN publishers AS p ON p.publisher_id = l.publisher_id
        '''

In [17]:
pd.io.sql.read_sql(query, con = engine)

       publisher  count
0  Penguin Books     42

Наибольшее число книг (42) издали в **Penguin Books**

## Автор с самой высокой средней оценкой книг

In [18]:
query = ''' WITH list AS
            (
            SELECT book_id, AVG(rating), COUNT(rating_id) 
            FROM ratings
            GROUP BY book_id
            HAVING COUNT(rating_id) > 50
            )
SELECT a.author, AVG(r.avg)
           FROM books AS b
           JOIN list AS r ON b.book_id = r.book_id
           JOIN authors AS a ON b.author_id = a.author_id
           GROUP BY a.author
           ORDER BY AVG(r.avg) DESC
           LIMIT 1
        '''

In [19]:
pd.io.sql.read_sql(query, con = engine)

                       author       avg
0  J.K. Rowling/Mary GrandPré  4.283844

У книг **J.K. Rowling/Mary GrandPré** самые высокие оценки.

## Cреднее количество обзоров от пользователей, которые поставили больше 50 оценок

In [20]:
query = '''
WITH list1 AS
    (
    WITH list AS
            (
            SELECT  username, COUNT(rating_id)
            FROM ratings
            GROUP BY username
            HAVING COUNT(rating_id) > 50
            )
            
            SELECT l.username, COUNT(r.review_id)
            FROM reviews AS r
            JOIN list AS l ON r.username = l.username
            GROUP BY l.username 
    )
    
SELECT AVG(count)
FROM list1
'''

In [21]:
pd.io.sql.read_sql(query, con = engine)

         avg
0  24.333333

Клиенты с числом оценок >50 в среднем сделали **24.3 обзора**